app/controllers/dashboard_controller.rb

INSERT INTO "google_documents" ("created_at", "file_url", "google_doc_url", "name", "permission", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def upload
    name = params[:file].original_filename
    directory = "public/"
    path = File.join(directory, name)
    File.open(path, "wb") { |f| f.write( params[:file].read) }
    gdoc = GoogleDocument.new(:name => name, :permission => "owner")
    #begin
      url = gdoc.upload_doc("public/#{name}")
    #rescue
      #render :text => "File format is not supported !!"
    #end

    unless url.blank?
      gdoc.save

INSERT INTO "google_documents" ("created_at", "file_url", "google_doc_url", "name", "permission", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 13 Dec 2011 09:03:01 UTC +00:00], ["file_url", nil], ["google_doc_url", nil], ["name", "bla.txt"], ["permission", "owner"], ["updated_at", Tue, 13 Dec 2011 09:03:01 UTC +00:00]]
---
  def upload_folder
    name = params[:file].original_filename
    directory = "public/"
    path = File.join(directory, name)
    File.open(path, "wb") { |f| f.write( params[:file].read) }
    gdoc = GoogleDocument.new(:name => name, :permission => "owner")
   # begin
      url = gdoc.upload_to_folder("public/#{name}",params[:folder])
    #rescue
    #  render :text => "File format is not supported !!"
    #end

    unless url.blank?
      gdoc.save

INSERT INTO "google_documents" ("created_at", "file_url", "google_doc_url", "name", "permission", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def upload_urls
    base_name = File.basename(params[:url])
    gdoc = GoogleDocument.new(:name => base_name, :permission => "owner")
    begin
      url = gdoc.upload_doc_url(params[:url])
    rescue
      render :text => "File format is not supported !!"
    end
    if url
      gdoc.save